modules/Event/Models/Event.php

    public function hasWishList()
    {
        return $this->hasOne($this->userWishListClass, 'object_id', 'id')->where('object_model', $this->type)->where('user_id', Auth::id() ?? 0);
---
select * from `user_wishlist` where `user_wishlist`.`object_id` = 1 and `user_wishlist`.`object_id` is not null and `object_model` = 'event' and `user_id` = 6 limit 1