modules/Space/Models/Space.php

select count(`id`) as aggregate from `bravo_space_dates` where (`start_date` >= '2024-01-09' and `end_date` <= '2024-01-17' and `active` = '0' and `target_id` = 9)
---
    public function isAvailableInRanges($start_date,$end_date){

        $days = max(1,floor((strtotime($end_date) - strtotime($start_date)) / DAY_IN_SECONDS));

        if($this->getBookingType() == 'by_night'){
            $end_date  = date("Y-m-d 23:59:59",strtotime($end_date." -1day"));
        }

        if($this->default_state)
        {
            $notAvailableDates = $this->spaceDateClass::query()->where([
                ['start_date','>=',$start_date],
                ['end_date','<=',$end_date],
                ['active','0'],
                ['target_id','=',$this->id],
            ])->count('id');

select * from `user_wishlist` where `user_wishlist`.`object_id` = 5 and `user_wishlist`.`object_id` is not null and `object_model` = 'space' and `user_id` = 6 limit 1
---
    public function hasWishList(){
        return $this->hasOne($this->userWishListClass, 'object_id','id')->where('object_model' , $this->type)->where('user_id' , Auth::id() ?? 0);