modules/Review/Models/Review.php

    public function getReviewMetaPicture()
    {
        return ReviewMeta::where("review_id", $this->id)->where('name', 'upload_picture')->first();
---
select * from `bravo_review_meta` where `review_id` = 248 and `name` = 'upload_picture' limit 1