modules/Space/Controllers/SpaceController.php

    public function detail(Request $request, $slug)
    {
        $row = $this->spaceClass::where('slug', $slug)->with(['location','translation','hasWishList'])->first();
        if ( empty($row) or !$row->hasPermissionDetailView()) {
            return redirect('/');
        }
        $translation = $row->translate();
        $space_related = [];
        $location_id = $row->location_id;
        if (!empty($location_id)) {
            $space_related = $this->spaceClass::where('location_id', $location_id)->where("status", "publish")->take(4)->whereNotIn('id', [$row->id])->with(['location','translation','hasWishList'])->get();
        }
        $review_list = $row->getReviewList();

        $dataIpanorama = RefRelationIpanorama::where('slug', $slug)
        ->join('ref_add_ipanorama', 'ref_relation_ipanorama.id_ipanorama', '=', 'ref_add_ipanorama.id')
        ->first();

        if($dataIpanorama) {
            $dataIpanorama = $dataIpanorama->code;
        }else{
            $dataIpanorama = null;
        }

        $data = [
            'row'          => $row,
            'translation'       => $translation,
            'space_related' => $space_related,
            'ipanorama' => $dataIpanorama,
            'location_category'=>$this->locationCategoryClass::where("status", "publish")->with('location_category_translations')->get(),
---
select * from `ref_relation_ipanorama` inner join `ref_add_ipanorama` on `ref_relation_ipanorama`.`id_ipanorama` = `ref_add_ipanorama`.`id` where `slug` = 'luxury-single' limit 1
select * from `location_category` where `status` = 'publish' and `location_category`.`deleted_at` is null