app/Http/Controllers/ExploreController.php

select * from `product_category` where `type` = 'business'
---
    public function index(Request $request)
    {
        $searchTerm = $request->input('location');
        $keyword = $request->input('keyword');

        $business = Business::take(5)->get();

        $businessCategories = ProductCategory::where('type', 'business')->get();