app/Http/Controllers/VirtuardController.php

select * from `subscribe_virtuard` where `id_user` = 6
---
    public function vendorVirtuardIndex()
    {
        $idUser = Auth::id();
        $data = SubscribeVirtuard::where('id_user', $idUser)->get();

select * from `subscribe_virtuard` where `id_user` is null
---
    public function vendorVirtuardAdd()
    {
        $idUser = Auth::id();
        $data = SubscribeVirtuard::where('id_user', $idUser)->get();