app/Providers/FortifyServiceProvider.php

            return view('auth.passwords.reset');
        });

        Fortify::authenticateUsing(function (Request $request) {
            $user = User::where('email', $request->email)->first();

            if ($user && $user->need_update_pw == '2') {
                abort(403);
            }

            if ($user && Hash::check($request->password, $user->password) and $user->status == "publish") {
                $user->last_login_at = now();
                $user->save();

                return $user;
            }
        });
---
select * from `users` where `email` = 'vendor@gmail.com' and `users`.`deleted_at` is null limit 1