app/Providers/GlobalViewComposerServiceProvider.php

    public function boot()
    {
        view()->composer('*', function ($view) {
            $today = Carbon::now();
            $storyData = Story::whereDate('created_at', $today->toDateString())
                ->latest()
                ->take('10')
                ->get();
---
select * from `ref_story` where date(`created_at`) = '2024-01-07' order by `created_at` desc limit 10